Конфигурация/Reports/РегламентированныйОтчетФинансовыеОперацииНПФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>РегламентированныйОтчетФинансовыеОперацииНПФ</Name>
		</Properties>
	</Report>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатистикаРаботыВнутреннихМеханизмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатистикаРаботыВнутреннихМеханизмов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачалоМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончаниеМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПараметрыВыполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сеанс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СессияЗавершенаСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Механизм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаВыполнения</Name>
					<Comment>Должна соответствовать дате из ПериодВыполненияНачало. Служит для групповой обработки записей</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РеформацииБалансов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеформацииБалансов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРеформации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Reports/РегламентированныйОтчетФинансовыеОперацииНПФ/Forms/ОсновнаяФорма/Ext/Form/Module.bsl
&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьПериод(Форма, ОргДатаРегистрации)
	
	ВидПериода = ВидПериодаОтчета(Форма, ОргДатаРегистрации);
	
	Если ВидПериода = "Нестандартный" Тогда
		СтрПериодОтчета = ПредставлениеПериода(Форма.мДатаНачалаПериодаОтчета, Форма.мДатаКонцаПериодаОтчета);
	ИначеЕсли ВидПериода = "Сокращенный" Тогда
		СтрПериодОтчета = Формат(Форма.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy")
			+ " - " + Формат(Форма.мДатаКонцаПериодаОтчета, "ДФ='ММММ гггг'");
	ИначеЕсли ВидПериода = "Стандартный" Тогда
		Если Месяц(Форма.мДатаКонцаПериодаОтчета) = 1 Тогда
			СтрПериодОтчета = Формат(Форма.мДатаКонцаПериодаОтчета, "ДФ='ММММ гггг'") + " г.";
		Иначе
			СтрПериодОтчета = "Январь - " + Формат(Форма.мДатаКонцаПериодаОтчета, "ДФ='ММММ гггг'") + " г.";
		КонецЕсли;
	КонецЕсли;
	
	Форма.ПолеВыбораПериодичностиПоказаПериода = СтрПериодОтчета;
	
	КоличествоФорм = КонсолидированнаяОтчетностьКлиентСервер.КоличествоФормСоответствующихВыбранномуПериоду(Форма);
	Если КоличествоФорм >= 1 Тогда
		Форма.Элементы.ПолеРедакцияФормы.Видимость    = КоличествоФорм > 1;
		Форма.Элементы.ОткрытьФормуОтчета.Доступность = Истина;
	Иначе
		Форма.Элементы.ПолеРедакцияФормы.Видимость    = Ложь;
		Форма.Элементы.ОткрытьФормуОтчета.Доступность = Ложь;
		Форма.ОписаниеНормативДок = "Отсутствует в программе.";
	КонецЕсли;
	
	КонсолидированнаяОтчетностьКлиентСервер.ВыборФормыРегламентированногоОтчетаПоУмолчанию(Форма);
	
	// В РезультирующаяТаблица - действующие на выбранный период формы.
	// Заполним список выбора форм отчетности.
	Форма.Элементы.ПолеРедакцияФормы.СписокВыбора.Очистить();
	
	Для Каждого ЭлФорма Из Форма.РезультирующаяТаблица Цикл
		Форма.Элементы.ПолеРедакцияФормы.СписокВыбора.Добавить(ЭлФорма.РедакцияФормы);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьПериод(Форма, Шаг)
	
	Форма.мДатаКонцаПериодаОтчета  = КонецМесяца(ДобавитьМесяц(Форма.мДатаКонцаПериодаОтчета, Шаг));
	Форма.мДатаНачалаПериодаОтчета = НачалоГода(Форма.мДатаКонцаПериодаОтчета);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВидПериодаОтчета(Форма, ОргДатаРегистрации)
	
	Если Форма.НестандартныйПериод Тогда
	    Возврат "Нестандартный";
	КонецЕсли;
	
	ДатаРегистрации = НачалоДня(ОргДатаРегистрации);
	ДатаНачалаОбычногоПериода = НачалоГода(Форма.мДатаКонцаПериодаОтчета);
	
	Если (ДатаРегистрации > ДатаНачалаОбычногоПериода И ДатаРегистрации < Форма.мДатаКонцаПериодаОтчета) Тогда
		Возврат "Сокращенный";
	Иначе
		Возврат "Стандартный";
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОткорректироватьНачальныйПериод(ВыбОрганизация)
	
	Если НЕ ЗначениеЗаполнено(мДатаНачалаПериодаОтчета) ИЛИ НЕ ЗначениеЗаполнено(мДатаКонцаПериодаОтчета) Тогда
		мДатаКонцаПериодаОтчета = КонецКвартала(ДобавитьМесяц(КонецКвартала(ТекущаяДатаСеанса()), -3));
		мДатаНачалаПериодаОтчета = НачалоГода(мДатаКонцаПериодаОтчета);
	КонецЕсли;
	
	ДатаРегистрации = НачалоДня(ВыбОрганизация.ДатаНачалаУчета);
	
	Если мДатаКонцаПериодаОтчета < ДатаРегистрации Тогда
		// Период предшествует дате регистрации.
		мДатаКонцаПериодаОтчета = КонецКвартала(ДатаРегистрации);
		мДатаНачалаПериодаОтчета = ДатаРегистрации;
	ИначеЕсли мДатаНачалаПериодаОтчета <= ДатаРегистрации И ДатаРегистрации <= мДатаКонцаПериодаОтчета Тогда
		// Период содержит дату регистрации.
		мДатаНачалаПериодаОтчета = НачалоГода(ДатаРегистрации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКнопокПериода(Форма, ОргДатаРегистрации);
	
	ВидПериода = ВидПериодаОтчета(Форма, ОргДатаРегистрации);
	
	Если ВидПериода = "Нестандартный" Тогда
		Форма.Элементы.УстановитьПредыдущийПериод.Доступность = Ложь;
		Форма.Элементы.УстановитьСледующийПериод.Доступность = Ложь;
	ИначеЕсли ВидПериода = "Сокращенный" Тогда
		Форма.Элементы.УстановитьСледующийПериод.Доступность = Истина;
		Если КонецМесяца(Форма.мДатаКонцаПериодаОтчета) <= КонецМесяца(Форма.мДатаНачалаПериодаОтчета) Тогда
			Форма.Элементы.УстановитьПредыдущийПериод.Доступность = Ложь;
		Иначе
			Форма.Элементы.УстановитьПредыдущийПериод.Доступность = Истина;
		КонецЕсли;
	Иначе
		Форма.Элементы.УстановитьПредыдущийПериод.Доступность = Истина;
		Форма.Элементы.УстановитьСледующийПериод.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета) Тогда
		
		ЭтаФорма.Организация             		= ЭтаФорма.НастройкиОтчета.Организация;
		ЭтаФорма.СчетДоверительногоУправления	= ЭтаФорма.НастройкиОтчета.СчетДоверительногоУправления;
		ЭтаФорма.мДатаНачалаПериодаОтчета 		= ЭтаФорма.НастройкиОтчета.Период.ДатаНачала;
		ЭтаФорма.мДатаКонцаПериодаОтчета  		= ЭтаФорма.НастройкиОтчета.Период.ДатаОкончания;
		ЭтаФорма.мСохраненныйДок          		= ЭтаФорма.НастройкиОтчета.РегламентированныйОтчет;
		ЭтаФорма.мВыбраннаяФорма          		= ЭтаФорма.НастройкиОтчета.ВыбраннаяФорма1ФС;
		
	Иначе
		
		ЭтаФорма.Организация             		= Параметры.Организация;
		ЭтаФорма.СчетДоверительногоУправления	= Параметры.СчетДоверительногоУправления;
		ЭтаФорма.мДатаНачалаПериодаОтчета 		= Параметры.мДатаНачалаПериодаОтчета;
		ЭтаФорма.мДатаКонцаПериодаОтчета  		= Параметры.мДатаКонцаПериодаОтчета;
		ЭтаФорма.мСкопированаФорма        		= Параметры.мСкопированаФорма;
		ЭтаФорма.мСохраненныйДок          		= Параметры.мСохраненныйДок;
		
	КонецЕсли;	
	
	ЭтаФормаИмя = Строка(ЭтаФорма.ИмяФормы);
	ИсточникОтчета = КонсолидированнаяОтчетность.ИсточникОтчета(ЭтаФормаИмя);
	ЗначениеВДанныеФормы(Отчеты[ИсточникОтчета].ТаблицаФормОтчета(), мТаблицаФормОтчета);
	
	Элементы.ПолеРедакцияФормы.Видимость = НЕ (мТаблицаФормОтчета.Количество() > 1);
	
	Если мДатаКонцаПериодаОтчета <> Неопределено И НЕ ЭтаФорма.НестандартныйПериод Тогда
		ИзменитьПериод(ЭтаФорма, 0);
	КонецЕсли;
	
	ОткорректироватьНачальныйПериод(ЭтаФорма.Организация);
	
	ЭтаФорма.ОрганизацияДатаРегистрации = ЭтаФорма.Организация.ДатаНачалаУчета;
	
	ПоказатьПериод(ЭтаФорма, ОрганизацияДатаРегистрации);
	
	УстановитьДоступностьКнопокПериода(ЭтаФорма, ОрганизацияДатаРегистрации); 
		
КонецПроцедуры

&НаКлиенте
Процедура ПолеРедакцияФормыПриИзменении(Элемент)
	
	СтрРедакцияФормы = ПолеРедакцияФормы;
	// Ищем в таблице мТаблицаФормОтчета для определения выбранной формы отчета.
	ЗаписьПоиска = Новый Структура;
	ЗаписьПоиска.Вставить("РедакцияФормы",СтрРедакцияФормы);
	МассивСтрок = мТаблицаФормОтчета.НайтиСтроки(ЗаписьПоиска);
	
	Если МассивСтрок.Количество() > 0 Тогда
		ВыбраннаяФорма = МассивСтрок[0];
		// Присваиваем.
		мВыбраннаяФорма     = ВыбраннаяФорма.ФормаОтчета;
		ОписаниеНормативДок = ВыбраннаяФорма.ОписаниеОтчета;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПредыдущийПериод(Команда)
	
	ИзменитьПериод(ЭтаФорма, -1);
	
	ВидПериода = ВидПериодаОтчета(ЭтаФорма, ОрганизацияДатаРегистрации);
	Если ВидПериода <> "Стандартный" Тогда
		мДатаНачалаПериодаОтчета = ОрганизацияДатаРегистрации;
	КонецЕсли;
	
	ПоказатьПериод(ЭтаФорма, ОрганизацияДатаРегистрации);
	
	УстановитьДоступностьКнопокПериода(ЭтаФорма, ОрганизацияДатаРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСледующийПериод(Команда)
	
	ИзменитьПериод(ЭтаФорма, 1);
	
	ВидПериода = ВидПериодаОтчета(ЭтаФорма, ОрганизацияДатаРегистрации);
	Если ВидПериода <> "Стандартный" Тогда
		мДатаНачалаПериодаОтчета = ОрганизацияДатаРегистрации;
	КонецЕсли;
	
	ПоказатьПериод(ЭтаФорма, ОрганизацияДатаРегистрации);
	
	УстановитьДоступностьКнопокПериода(ЭтаФорма, ОрганизацияДатаРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтчета(Команда)
	
	Если мСкопированаФорма <> Неопределено Тогда
		// Документ был скопирован.
		// Проверяем соответствие форм.
		Если мВыбраннаяФорма <> мСкопированаФорма Тогда
			
			ПоказатьПредупреждение(,НСтр("ru='Форма отчета изменилась, копирование невозможно!'"));
			Возврат;
			
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.СчетДоверительногоУправления) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Счет доверительного управления не заполнен", , "СчетДоверительногоУправления");
		Возврат;
		
	КонецЕсли;
	
	Если ЭтаФорма.НастройкиОтчета <> Неопределено
		И ЭтаФорма.НастройкиОтчета.Свойство("АвтоматическоеФормирование")
		И ЭтаФорма.НастройкиОтчета.АвтоматическоеФормирование
		И ЭтаФорма.НастройкиОтчета.Свойство("Период")
		И (ЭтаФорма.НастройкиОтчета.Период.ДатаНачала <> мДатаНачалаПериодаОтчета
			ИЛИ ЭтаФорма.НастройкиОтчета.Период.ДатаОкончания <> мДатаКонцаПериодаОтчета) Тогда
			
		НестандартныйПериод			= Истина;
		мДатаНачалаПериодаОтчета	= ЭтаФорма.НастройкиОтчета.Период.ДатаНачала;
		мДатаКонцаПериодаОтчета		= ЭтаФорма.НастройкиОтчета.Период.ДатаОкончания;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("мДатаНачалаПериодаОтчета", 	мДатаНачалаПериодаОтчета);
	ПараметрыФормы.Вставить("мДатаКонцаПериодаОтчета",  	мДатаКонцаПериодаОтчета);
	ПараметрыФормы.Вставить("мСохраненныйДок",          	мСохраненныйДок);
	ПараметрыФормы.Вставить("мСкопированаФорма",        	мСкопированаФорма);
	ПараметрыФормы.Вставить("Организация",              	Организация);
	ПараметрыФормы.Вставить("СчетДоверительногоУправления", СчетДоверительногоУправления);
	ПараметрыФормы.Вставить("мВыбраннаяФорма",          	мВыбраннаяФорма);
	ПараметрыФормы.Вставить("мРедакцияФормы",				ПолеРедакцияФормы);
	ПараметрыФормы.Вставить("НастройкиОтчета",          	НастройкиОтчета);
	ПараметрыФормы.Вставить("НестандартныйПериод",         	НестандартныйПериод);
		
	Если ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") И ЭтаФорма.НастройкиОтчета.Свойство("АвтоматическоеФормирование") Тогда
		
		Сессия = ЗарегистрироватьНовуюСессию(ПараметрыФормы);

		Форма = ПолучитьФорму(СтрЗаменить(ЭтаФорма.ИмяФормы, "ОсновнаяФорма", "") + мВыбраннаяФорма, ПараметрыФормы, , Истина);
		Форма.АвтоматическоеФормирование();
		Если ЭтаФорма.НастройкиОтчета.Свойство("ОткрытьФорму") Тогда
			Форма.Открыть();
		КонецЕсли;
		
		ЗафиксироватьОкончаниеСессии(Сессия);
		
	Иначе
		Форма = ОткрытьФорму(СтрЗаменить(ЭтаФорма.ИмяФормы, "ОсновнаяФорма", "") + мВыбраннаяФорма, ПараметрыФормы, , Истина);
	    Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗарегистрироватьНовуюСессию(ПараметрыФормы)
		
	Описание = "";
	Для Каждого Параметр Из ПараметрыФормы Цикл
		
		Если Параметр.Ключ = "НастройкиОтчета" Тогда
			
			Если ТипЗнч(Параметр.Значение) = Тип("Структура") Тогда
			
				Для Каждого ПараметрНастроекОтчета Из Параметр.Значение Цикл
					Описание = Описание + ?(Описание = "", "", Символы.ПС) + ПараметрНастроекОтчета.Ключ + ": " + ПараметрНастроекОтчета.Значение;	
				КонецЦикла;
				
			КонецЕсли;
			
			Продолжить;
	
		КонецЕсли;
	
		Описание = Описание + ?(Описание = "", "", Символы.ПС) + Параметр.Ключ + ": " + Параметр.Значение;
	
	КонецЦикла; 
		
	Хранилище = Новый ХранилищеЗначения(ПараметрыФормы, Новый СжатиеДанных(9));
	
	Возврат РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Метаданные.Отчеты.РегламентированныйОтчетФинансовыеОперацииНПФ.ПолноеИмя(), Хранилище, Описание);		

КонецФункции

&НаСервереБезКонтекста
Процедура ЗафиксироватьОкончаниеСессии(Сессия)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Метаданные.Отчеты.РегламентированныйОтчетФинансовыеОперацииНПФ.ПолноеИмя(), Сессия);
		
КонецПроцедуры

&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	ОткрытьФормуОтчета(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Функция СоздатьИЗаполнитьОтчет()
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.СчетДоверительногоУправления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Счет доверительного управления не заполнен", , "СчетДоверительногоУправления");
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЭтаФорма.НастройкиОтчета.Свойство("Период")
		И (ЭтаФорма.НастройкиОтчета.Период.ДатаНачала <> мДатаНачалаПериодаОтчета
			ИЛИ ЭтаФорма.НастройкиОтчета.Период.ДатаОкончания <> мДатаКонцаПериодаОтчета) Тогда
		НестандартныйПериод			= Истина;
		мДатаНачалаПериодаОтчета	= ЭтаФорма.НастройкиОтчета.Период.ДатаНачала;
		мДатаКонцаПериодаОтчета		= ЭтаФорма.НастройкиОтчета.Период.ДатаОкончания;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("мДатаНачалаПериодаОтчета", 	мДатаНачалаПериодаОтчета);
	ПараметрыФормы.Вставить("мДатаКонцаПериодаОтчета",  	мДатаКонцаПериодаОтчета);
	ПараметрыФормы.Вставить("мСохраненныйДок",          	мСохраненныйДок);
	ПараметрыФормы.Вставить("мСкопированаФорма",        	мСкопированаФорма);
	ПараметрыФормы.Вставить("Организация",              	Организация);
	ПараметрыФормы.Вставить("СчетДоверительногоУправления", СчетДоверительногоУправления);
	ПараметрыФормы.Вставить("мВыбраннаяФорма",          	мВыбраннаяФорма);
	ПараметрыФормы.Вставить("мРедакцияФормы",				ПолеРедакцияФормы);
	ПараметрыФормы.Вставить("НастройкиОтчета",          	НастройкиОтчета);
	ПараметрыФормы.Вставить("НестандартныйПериод",         	НестандартныйПериод);
	
	Форма = ПолучитьФорму(СтрЗаменить(ЭтаФорма.ИмяФормы, "ОсновнаяФорма", "") + мВыбраннаяФорма, ПараметрыФормы, , Истина);
	
	Форма.Заполнить();
	
	Возврат Форма;
	
КонецФункции

&НаКлиенте
Процедура СоздатьИЗаписать() Экспорт
	
	Форма = СоздатьИЗаполнитьОтчет();
	
	Если Форма <> Неопределено Тогда
		Форма.СохранитьНаКлиенте();
		мСохраненныйДок = Форма.СтруктураРеквизитовФормы.мСохраненныйДок;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФорму() Экспорт
	
	Форма = СоздатьИЗаполнитьОтчет();
	
	Если Форма <> Неопределено Тогда
		Форма.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ЭтаФорма.НестандартныйПериод = Ложь;
	НестандартныйПериодПриИзменении(ЭтаФорма.Элементы.НестандартныйПериод);
	
	ПоказатьПериод(ЭтаФорма, ОрганизацияДатаРегистрации);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПериодовСУчетомРеформаций()

	Возврат РегистрыСведений.РеформацииБалансов.ПолучитьСписокПериодовСУчетомРеформаций(
			ЭтаФорма.СчетДоверительногоУправления,
			НачалоГода(ЭтаФорма.мДатаНачалаПериодаОтчета),
			КонецГода(ЭтаФорма.мДатаКонцаПериодаОтчета));

КонецФункции 

&НаКлиенте
Процедура НестандартныйПериодПриИзменении(Элемент)
	
	Если ЭтаФорма.НестандартныйПериод Тогда
	
		СписокВыбора = ПолучитьСписокПериодовСУчетомРеформаций();
		
		ЭтаФорма.Элементы.ПолеПериодРеформации.СписокВыбора.Очистить();
		
		Для каждого ЭлементСписокВыбора Из СписокВыбора Цикл
			ЗаполнитьЗначенияСвойств(ЭтаФорма.Элементы.ПолеПериодРеформации.СписокВыбора.Добавить(), ЭлементСписокВыбора);
		КонецЦикла; 		
		
	Иначе
		
		ЭтаФорма.мДатаНачалаПериодаОтчета = Неопределено;
		ЭтаФорма.мДатаКонцаПериодаОтчета = Неопределено;
		ОткорректироватьНачальныйПериод(ЭтаФорма.Организация);
		ПоказатьПериод(ЭтаФорма, ОрганизацияДатаРегистрации);
		
	КонецЕсли;
	
	ЭтаФорма.Элементы.ПолеПериодРеформации.Доступность = ЭтаФорма.НестандартныйПериод;
	ЭтаФорма.Элементы.ПолеНестандартногоПериода.Доступность = ЭтаФорма.НестандартныйПериод;
	
	УстановитьДоступностьКнопокПериода(ЭтаФорма, ЭтаФорма.ОрганизацияДатаРегистрации);
	
КонецПроцедуры


&НаКлиенте
Процедура ПолеПериодРеформацииПриИзменении(Элемент)
	
	ЭтаФорма.мДатаНачалаПериодаОтчета = ЭтаФорма.ПолеПериодРеформации.НачалоПериода;
	ЭтаФорма.мДатаКонцаПериодаОтчета = ЭтаФорма.ПолеПериодРеформации.КонецПериода;
	
	ЭтаФорма.ПолеНестандартногоПериода.ДатаНачала = ЭтаФорма.ПолеПериодРеформации.НачалоПериода;
	ЭтаФорма.ПолеНестандартногоПериода.ДатаОкончания = ЭтаФорма.ПолеПериодРеформации.КонецПериода;
	
	ПоказатьПериод(ЭтаФорма, ОрганизацияДатаРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеНестандартногоПериодаПриИзменении(Элемент)
	
	ЭтаФорма.мДатаНачалаПериодаОтчета = ЭтаФорма.ПолеНестандартногоПериода.ДатаНачала;
	ЭтаФорма.мДатаКонцаПериодаОтчета = ЭтаФорма.ПолеНестандартногоПериода.ДатаОкончания;
	
	ПоказатьПериод(ЭтаФорма, ОрганизацияДатаРегистрации);
	
КонецПроцедуры
